car-dealership-api/app/controllers/cars_controller.rb

INSERT INTO "cars" ("model", "maker", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["model", "Corsa Premium 1.4 econoflex"], ["maker", "Chevrolet"], ["year", "2008"], ["created_at", "2022-08-27 16:17:48.948764"], ["updated_at", "2022-08-27 16:17:48.948764"]]
---
  def create
    @car = Car.new(car_params)

    if @car.save

UPDATE "cars" SET "model" = $1, "updated_at" = $2 WHERE "cars"."id" = $3  [["model", "Corsa Premium 1.8 econoflex"], ["updated_at", "2022-08-27 16:19:05.185889"], ["id", 1]]
---
  def update
    if @car.update(car_params)

DELETE FROM "cars" WHERE "cars"."id" = $1  [["id", 2]]
---
  def destroy
    @car.destroy

SELECT "cars".* FROM "cars" WHERE "cars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_car
      @car = Car.find(params[:id])